import { TreeNode } from '../components/TreeView/utils';

export const mocks: TreeNode<string>[] = [
  {
    id: '0',
    name: 'Концептуальные',
    children: [
      {
        id: '1',
        name: 'Ханаанский бальзам',
        children: [
          {
            id: '2',
            name: 'Денатурат (технический спирт) — 100 г.',
          },
          {
            id: '3',
            name: 'Бархатное пиво — 200 г.',
          },
          {
            id: '4',
            name: 'Политура очищенная — 100 г.',
          },
        ],
      },
      {
        id: '5',
        name: 'Дух Женевы',
        children: [
          {
            id: '6',
            name: 'Духи «Белая сирень» — 50 г.',
          },
          {
            id: '7',
            name: 'Средство от потливости ног — 50 г.',
          },
          {
            id: '8',
            name: 'Пиво «Жигулевское» — 200 г.',
          },
          {
            id: '9',
            name: 'Лак спиртовой — 150 г.',
          },
        ],
      },
      {
        id: '10',
        name: 'Слеза комсомолки',
        children: [
          {
            id: '11',
            name: 'Лаванда — 15 г.',
          },
          {
            id: '12',
            name: 'Вербена —15 г.',
          },
          {
            id: '13',
            name: '«Лесная вода» — 30 г.',
          },
          {
            id: '14',
            name: 'Лак для ногтей — 2 г.',
          },
          {
            id: '15',
            name: 'Зубной эликсир — 150 г.',
          },
          {
            id: '16',
            name: 'Лимонад — 150 г.',
          },
        ],
      },
      {
        id: '17',
        name: 'Поцелуй тети Клавы',
        children: [
          {
            id: '18',
            name: 'Водка',
          },
          {
            id: '19',
            name: 'Розовое крепкое вино',
          },
        ],
      },
      {
        id: '20',
        name: 'Сучий потрох',
        children: [
          {
            id: '21',
            name: 'Пиво «Жигулевское» — 100 г.',
          },
          {
            id: '22',
            name: 'Шампунь «Садко – богатый гость» — 30 г.',
          },
          {
            id: '23',
            name: 'Резоль для очистки волос от перхоти — 70 г.',
          },
          {
            id: '24',
            name: 'Средство от потливости ног — 30 г.',
          },
          {
            id: '25',
            name: 'Дезинсектакль для уничтожения мелких насекомых — 20 г.',
          },
        ],
      },
    ],
  },
  {
    id: 'c',
    name: 'Классика',
    children: [
      {
        id: 'ersh',
        name: 'Ёрш',
        children: [
          {
            id: 'vodka',
            name: 'Водка «Столичная» — 50 г.',
          },
          {
            id: 'beer',
            name: 'Пиво «Жигулёвское» — 500 г.',
          },
        ],
      },
      {
        id: 'irish-bomb',
        name: 'Ирландская автомобильная бомба',
        children: [
          {
            id: 'ib_jameson',
            name: 'Виски Jameson — 50 г.',
          },
          {
            id: 'ib_liq',
            name: 'Ликёр Baileys Irish Cream — 50 г.',
          },
          {
            id: 'ib_stout',
            name: 'Пиво Guinness — 500 г.',
          },
        ],
      },
    ],
  },
];
